# Filter Numeric Rule Evaluator Evaluate Method

Source: https://www.revitapidocs.com/2026/2b8a81e5-aacb-22d8-540d-c0239c6491d8.htm

---

| Filter Numeric Rule Evaluator Evaluate Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Evaluate(Int64, Int64\) | Derived classes should override this method to implement the desired test. |
|  | Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines  whether the two given double\-precision values satisfy the desired condition or not. |

Top See Also

#### Reference

FilterNumericRuleEvaluator Class Autodesk.Revit.DB Namespace